open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_scale_rotate.c
/* SPDX-License-Identifier: Apache-2.0 */
/****************************************************************************
 * tests/host/bk7258/modules/ap/test_bk7258_scale_rotate.c
 *
 * Host unit suite for chips/bk7258/ap/bk7258_scale_rotate.c (true
 * source, patched copy built via framework/patch.py, see Makefile).
 *
 * The driver wraps the SDK scale (bk_hw_scale_*) and rotator (bk_rott_*)
 * bundles plus the CPU1 interrupt-route ABI.  The suite mock SDK mirrors
 * the caching/logging style of mock_sdk_yuv_h264: programmable results,
 * captured ISR callbacks re-fired from a tickwait hook (the driver blocks
 * in a single nxsem_tickwait per operation), config snapshots, and the
 * Scale1 write-burst register poke through mock_reg32.
 *
 * Determinism rules (same as the yuv suite):
 *   - all media buffers must be static (32-bit SDK address contract)
 *   - SDK results are snapshotted at driver-return time
 *   - tickwait with no posted event times out (-ETIMEDOUT)
 *   - a tickwait hook is the only way to fire ISRs inside the wait
 ****************************************************************************/

#include <stdarg.h>
#include <stddef.h>
#include <stdint.h>
#include <errno.h>
#include <setjmp.h>
#include <stdio.h>
#include <string.h>

#include <cmocka.h>

#include <common/bk_err.h>
#include <nuttx/semaphore.h>

#include "mock_sdk_scale_rotate.h"
#include "mock_reg32.h"
#include "bk7258_scale_rotate.h"

/* Media geometry: 64x64 RGB565 (2 bytes/pixel). */
#define FRAME_BYTES   (64u * 64u * 2u)
#define ROTATE_BYTES  (64u * 48u * 2u)

#define SCALE1_THRESHOLD_REG 0x480e0040u
#define SCALE1_THRESHOLD_MASK 0x00000fffu

static uint8_t g_src[FRAME_BYTES];
static uint8_t g_dst[FRAME_BYTES];
static uint8_t g_rsrc[ROTATE_BYTES];
static uint8_t g_rdst[ROTATE_BYTES];

struct bk7258_scale_rotate_s *g_priv;

/* ---------------------------------------------------------------------- */
/* Helpers                                                                */
/* ---------------------------------------------------------------------- */

static void sr_setup(void)
{
  mock_sr_sdk_reset();
  mock_reg32_reset();
  g_priv = NULL;
}

static int sr_group_setup(void **state)
{
  (void)state;
  return 0;
}

static int sr_group_teardown(void **state)
{
  (void)state;
  if (g_priv != NULL)
    {
      (void)bk7258_scale_rotate_uninitialize(g_priv);
      g_priv = NULL;
    }

  return 0;
}

static int sr_setup_reset(void **state)
{
  (void)state;
  sr_setup();
  return 0;
}

static int sr_setup_ok(void **state)
{
  sr_setup();
  assert_int_equal(bk7258_scale_rotate_initialize(&g_priv,
                                                  BK7258_SCALE_ROTATE_SCALE0),
                   0);
  return 0;
}

static int sr_setup_rotator(void **state)
{
  sr_setup();
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   0);
  return 0;
}

static int sr_teardown_ok(void **state)
{
  (void)state;
  if (g_priv != NULL)
    {
      (void)bk7258_scale_rotate_uninitialize(g_priv);
      g_priv = NULL;
    }

  return 0;
}

static void sr_fire_scale0_hook(void)
{
  mock_sr_fire_scale(HW_SCALE0);
}

static void sr_fire_scale1_hook(void)
{
  mock_sr_fire_scale(HW_SCALE1);
}

static void sr_fire_rott_complete_hook(void)
{
  mock_sr_fire_rott_complete();
}

static void sr_fire_rott_error_hook(void)
{
  mock_sr_fire_rott_error();
}

static void sr_post_spurious_hook(void)
{
  mock_sr_post_completion();
}

static struct bk7258_scale_request_s sr_scale_request(uint8_t *src,
                                                      uint8_t *dst,
                                                      size_t src_size,
                                                      size_t dst_size)
{
  struct bk7258_scale_request_s request;

  memset(&request, 0, sizeof(request));
  request.src = src;
  request.dst = dst;
  request.src_size = src_size;
  request.dst_size = dst_size;
  request.src_width = 64;
  request.src_height = 64;
  request.dst_width = 64;
  request.dst_height = 64;
  request.format = BK7258_SCALE_ROTATE_RGB565;
  request.timeout_ms = 100;
  return request;
}

static struct bk7258_rotate_request_s sr_rotate_request(uint8_t *src,
                                                        uint8_t *dst,
                                                        size_t src_size,
                                                        size_t dst_size)
{
  struct bk7258_rotate_request_s request;

  memset(&request, 0, sizeof(request));
  request.src = src;
  request.dst = dst;
  request.src_size = src_size;
  request.dst_size = dst_size;
  request.src_width = 64;
  request.src_height = 48;
  request.block_width = 16;
  request.block_height = 16;
  request.block_count = 12;
  request.watermark_block = 0;
  request.format = BK7258_SCALE_ROTATE_RGB565;
  request.angle = BK7258_SCALE_ROTATE_90;
  request.input_flow = BK7258_SCALE_ROTATE_INPUT_NORMAL;
  request.output_flow = BK7258_SCALE_ROTATE_OUTPUT_NORMAL;
  request.timeout_ms = 100;
  return request;
}

/* ---------------------------------------------------------------------- */
/* Initialize / uninitialize                                              */
/* ---------------------------------------------------------------------- */

static void sr_init_ok_scale0(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  assert_non_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_INIT), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_ISR_REGISTER), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_INT_ENABLE), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SYS_GROUP2_DISABLE), 0);
  assert_int_equal(mock_sr_call(0)->a0, HW_SCALE0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

static void sr_init_ok_scale1(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE1),
                   0);
  assert_int_equal(mock_sr_call(0)->a0, HW_SCALE1);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

static void sr_init_ok_rotator(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   0);
  assert_non_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_INIT), 0);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DRIVER_INIT), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ISR_REGISTER), 2);
  assert_int_equal(mock_sr_call(0)->fn, MOCK_SR_FN_ROTT_DRIVER_INIT);
  assert_int_equal(mock_sr_call(1)->a0, ROTATE_COMPLETE_INT);
  assert_int_equal(mock_sr_call(2)->a0, ROTATE_CFG_ERR_INT);
  assert_int_equal(mock_sr_call(3)->a0,
                   ROTATE_COMPLETE_INT | ROTATE_CFG_ERR_INT);
  assert_int_equal(mock_sr_call(3)->a1, 1);      /* enable */
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SYS_GROUP2_DISABLE), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SYS_GROUP2_ENABLE), 1);
  assert_int_equal(mock_sr_call(4)->a0, 2);      /* disable core2 */
  assert_int_equal(mock_sr_call(5)->a0, 1);      /* enable core1 */
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

static void sr_init_null_out(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     NULL, BK7258_SCALE_ROTATE_SCALE0),
                   -EINVAL);
  assert_int_equal(mock_sr_call_count(), 0);
}

