open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_scale_rotate.c
static void sr_init_invalid_engine(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, (enum bk7258_scale_rotate_engine_e)42),
                   -EINVAL);
  assert_null(g_priv);
  assert_int_equal(mock_sr_call_count(), 0);
}

static void sr_init_double(void **state)
{
  FAR struct bk7258_scale_rotate_s *once;
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  once = g_priv;
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   -EBUSY);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_INIT), 1);
  assert_int_equal(bk7258_scale_rotate_uninitialize(once), 0);
}

static void sr_init_scale_driver_init_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_ret(MOCK_SR_FN_SCALE_DRIVER_INIT, BK_ERR_NO_DEV);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   -ENODEV);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_MEM_FREE), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_DEINIT), 0);
}

static void sr_init_scale_isr_register_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_ret(MOCK_SR_FN_SCALE_ISR_REGISTER, BK_ERR_NO_MEM);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   -ENOMEM);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_DEINIT), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_MEM_FREE), 1);
}

static void sr_init_scale_int_enable_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_ret(MOCK_SR_FN_SCALE_INT_ENABLE, BK_ERR_TIMEOUT);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   -ETIMEDOUT);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_ISR_UNREGISTER), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_DEINIT), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_MEM_FREE), 1);
}

static void sr_init_rott_driver_init_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_ret(MOCK_SR_FN_ROTT_DRIVER_INIT, BK_ERR_NOT_INIT);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   -ENODEV);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ISR_REGISTER), 0);
}

static void sr_init_rott_complete_isr_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_ret(MOCK_SR_FN_ROTT_ISR_REGISTER, BK_ERR_NO_MEM);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   -ENOMEM);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DRIVER_DEINIT), 1);
}

static void sr_init_rott_int_enable_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_ret(MOCK_SR_FN_ROTT_INT_ENABLE, BK_ERR_PARAM);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   -EINVAL);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ISR_REGISTER), 4);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DRIVER_DEINIT), 1);
}

static void sr_init_rott_route_fail(void **state)
{
  (void)state;
  sr_setup();

  mock_sr_set_sys_enable(123);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   -EIO);
  assert_null(g_priv);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_INT_ENABLE), 2);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ISR_REGISTER), 4);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DRIVER_DEINIT), 1);
  /* route fail: disable(2) + enable-fail disable(1) + from_cpu1 disable(1) */

  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SYS_GROUP2_DISABLE), 3);
}

static void sr_uninit_twice(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), -ENODEV);
}

static void sr_uninit_bad_priv(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_uninitialize(
                     (struct bk7258_scale_rotate_s *)&g_src),
                   -EINVAL);
}

static void sr_uninit_scale0_ok(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_INT_ENABLE), 2);
  assert_int_equal(mock_sr_call(2)->a1, 1);      /* init enable(true) */
  assert_int_equal(mock_sr_call(3)->a1, 0);      /* uninit enable(false) */
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_ISR_UNREGISTER), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_DEINIT), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_MEM_FREE), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_STOP), 0);
}

static void sr_uninit_rotator_ok(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_INT_ENABLE), 2);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ISR_REGISTER), 4);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_SOFT_RESET), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DRIVER_DEINIT), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SYS_GROUP2_DISABLE), 2);
}

static void sr_uninit_scale_int_disable_fail(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  /* One-shot: teardown's retry must be able to complete the teardown. */

  mock_sr_set_ret_once(MOCK_SR_FN_SCALE_INT_ENABLE, BK_ERR_BUSY);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), -EBUSY);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_DRIVER_DEINIT), 0);
}

static void sr_reinit_engine_switch(void **state)
{
  (void)state;
  sr_setup();

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE1),
                   0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

/* ---------------------------------------------------------------------- */
/* Scale validation + errors                                              */
/* ---------------------------------------------------------------------- */

