open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_scale_rotate.c
static void sr_scale_null_request(void **state)
{
  (void)state;


  assert_int_equal(bk7258_scale(g_priv, NULL), -EINVAL);
}

static void sr_scale_on_rotator(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  assert_int_equal(bk7258_scale(g_priv, &request), -ENOTSUP);
}

static void sr_scale_unsupported_format(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  request.format = BK7258_SCALE_ROTATE_UVYY;
  assert_int_equal(bk7258_scale(g_priv, &request), -ENOTSUP);
}

static void sr_scale_dst_width_not_multiple_16(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  request.dst_width = 17;
  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
}

static void sr_scale_zero_dims(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  request.src_width = 0;
  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
}

static void sr_scale_dim_too_large(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  request.dst_height = 1281;
  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
}

static void sr_scale_src_size_too_small(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES - 1,
                                                            FRAME_BYTES);

  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
}

static void sr_scale_dst_size_too_small(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES - 1);

  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
}

static void sr_scale_overlap(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_src,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
}

static void sr_scale_stack_buffers(void **state)
{
  (void)state;


  uint8_t local[FRAME_BYTES];

  struct bk7258_scale_request_s request = sr_scale_request(local, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  assert_int_equal(bk7258_scale(g_priv, &request), -EOVERFLOW);
}

static void sr_scale_hw_frame_fail(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  mock_sr_set_ret(MOCK_SR_FN_SCALE_FRAME, BK_ERR_PARAM);
  assert_int_equal(bk7258_scale(g_priv, &request), -EINVAL);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_FRAME), 1);
  assert_int_equal(bk7258_scale(g_priv, &request), -EIO);
}

static void sr_scale_timeout(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  assert_int_equal(bk7258_scale(g_priv, &request), -ETIMEDOUT);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_STOP), 1);
  assert_int_equal(bk7258_scale(g_priv, &request), -EIO);
}

static void sr_scale_spurious_wake(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);

  mock_sr_set_tickwait_hook(sr_post_spurious_hook);
  assert_int_equal(bk7258_scale(g_priv, &request), -EIO);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_STOP), 1);
}

/* ---------------------------------------------------------------------- */
/* Scale happy paths                                                      */
/* ---------------------------------------------------------------------- */

static void sr_scale_scale0_happy(void **state)
{
  (void)state;


  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);
  const scale_drv_config_t *config;

  mock_sr_set_tickwait_hook(sr_fire_scale0_hook);
  assert_int_equal(bk7258_scale(g_priv, &request), 0);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_FRAME), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_SCALE_STOP), 0);
  config = mock_sr_scale_config();
  assert_int_equal(config->src_width, 64);
  assert_int_equal(config->src_height, 64);
  assert_int_equal(config->dst_width, 64);
  assert_int_equal(config->dst_height, 64);
  assert_int_equal(config->scale_mode, FRAME_SCALE);
  assert_int_equal(config->pixel_fmt, PIXEL_FMT_RGB565);
  assert_int_equal(config->line_cycle, 16);
  assert_int_equal(config->line_mask, 0x1f);
  assert_ptr_equal(config->src_addr, g_src);
  assert_ptr_equal(config->dst_addr, g_dst);
}

static void sr_scale_scale1_happy(void **state)
{
  (void)state;
  sr_setup();

  struct bk7258_scale_request_s request;
  uint32_t value;

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE1),
                   0);
  mock_reg32_set(SCALE1_THRESHOLD_REG, 0xf0000000u);

  mock_sr_set_tickwait_hook(sr_fire_scale1_hook);
  request = sr_scale_request(g_src, g_dst, FRAME_BYTES, FRAME_BYTES);
  request.dst_width = 128;
  request.dst_height = 32;
  assert_int_equal(bk7258_scale(g_priv, &request), 0);
  value = mock_reg32_read(SCALE1_THRESHOLD_REG);
  assert_int_equal(value & SCALE1_THRESHOLD_MASK, 64);
  assert_int_equal(value & ~SCALE1_THRESHOLD_MASK, 0xf0000000u);

  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

static void sr_scale_scale1_threshold_variants(void **state)
{
  (void)state;
  sr_setup();

  struct bk7258_scale_request_s request;

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE1),
                   0);
  mock_sr_set_tickwait_hook(sr_fire_scale1_hook);

  request = sr_scale_request(g_src, g_dst, FRAME_BYTES, FRAME_BYTES);
  request.dst_width = 96;
  request.dst_height = 32;
  assert_int_equal(bk7258_scale(g_priv, &request), 0);
  assert_int_equal(mock_reg32_read(SCALE1_THRESHOLD_REG) &
                     SCALE1_THRESHOLD_MASK,
                   16);

