open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_scale_rotate.c
  request.dst_width = 80;
  request.dst_height = 32;
  assert_int_equal(bk7258_scale(g_priv, &request), 0);
  assert_int_equal(mock_reg32_read(SCALE1_THRESHOLD_REG) &
                     SCALE1_THRESHOLD_MASK,
                   8);

  request.dst_width = 64;
  request.dst_height = 32;
  assert_int_equal(bk7258_scale(g_priv, &request), 0);
  assert_int_equal(mock_reg32_read(SCALE1_THRESHOLD_REG) &
                     SCALE1_THRESHOLD_MASK,
                   32);

  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

/* ---------------------------------------------------------------------- */
/* Rotate validation                                                      */
/* ---------------------------------------------------------------------- */

static void sr_rotate_on_scale(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  assert_int_equal(bk7258_rotate(g_priv, &request), -ENOTSUP);
}

static void sr_rotate_invalid_input_flow(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.input_flow = (enum bk7258_scale_rotate_input_flow_e)7;
  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_invalid_output_flow(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.output_flow = (enum bk7258_scale_rotate_output_flow_e)7;
  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_angle_180(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.angle = BK7258_SCALE_ROTATE_180;
  assert_int_equal(bk7258_rotate(g_priv, &request), -ENOTSUP);
}

static void sr_rotate_block_count_mismatch(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.block_width = 32;
  request.block_height = 32;
  request.block_count = 3;
  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_watermark_ge_count(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.watermark_block = 12;
  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_block_pixels_exceed(void **state)
{
  (void)state;


  static uint8_t big_src[420u * 420u * 2u];
  static uint8_t big_dst[420u * 420u * 2u];
  struct bk7258_rotate_request_s request = sr_rotate_request(
    big_src, big_dst, sizeof(big_src), sizeof(big_dst));

  request.src_width = 420;
  request.src_height = 420;
  request.block_width = 70;
  request.block_height = 70;
  request.block_count = 36;
  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_src_size_too_small(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES - 1,
                                                              ROTATE_BYTES);

  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_overlap(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rsrc,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
}

static void sr_rotate_config_fail(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  mock_sr_set_ret(MOCK_SR_FN_ROTT_CONFIG, BK_ERR_IN_PROGRESS);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EBUSY);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ENABLE), 0);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EIO);
}

static void sr_rotate_data_reverse_fail(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  mock_sr_set_ret(MOCK_SR_FN_ROTT_DATA_REVERSE, BK_ERR_PARAM);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EINVAL);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ENABLE), 0);
}

/* ---------------------------------------------------------------------- */
/* Rotate happy paths + errors                                            */
/* ---------------------------------------------------------------------- */

static void sr_rotate_happy_90(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);
  const rott_config_t *config;

