open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_scale_rotate.c
  request.watermark_block = 2;
  mock_sr_set_tickwait_hook(sr_fire_rott_complete_hook);
  assert_int_equal(bk7258_rotate(g_priv, &request), 0);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_CONFIG), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DATA_REVERSE), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_ENABLE), 1);
  config = mock_sr_rott_config();
  assert_int_equal(config->rot_mode, ROTATE_90);
  assert_ptr_equal(config->input_addr, g_rsrc);
  assert_ptr_equal(config->output_addr, g_rdst);
  assert_int_equal(config->input_fmt, PIXEL_FMT_RGB565);
  assert_int_equal(config->picture_xpixel, 64);
  assert_int_equal(config->picture_ypixel, 48);
  assert_int_equal(config->block_xpixel, 16);
  assert_int_equal(config->block_ypixel, 16);
  assert_int_equal(config->block_cnt, 12);
  assert_int_equal(config->watermark_blk, 2);
  assert_int_equal(mock_sr_reverse_input(), ROTT_INPUT_NORMAL);
  assert_int_equal(mock_sr_reverse_output(), ROTT_OUTPUT_NORMAL);
}

static void sr_rotate_happy_none(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.angle = BK7258_SCALE_ROTATE_NONE;
  mock_sr_set_tickwait_hook(sr_fire_rott_complete_hook);
  assert_int_equal(bk7258_rotate(g_priv, &request), 0);
  assert_int_equal(mock_sr_rott_config()->rot_mode, ROTATE_NONE);
  assert_int_equal(mock_sr_rott_config()->picture_xpixel, 64);
  assert_int_equal(mock_sr_rott_config()->picture_ypixel, 48);
}

static void sr_rotate_happy_reversed_flows(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  request.input_flow = BK7258_SCALE_ROTATE_INPUT_REVERSE_HALFWORD;
  request.output_flow = BK7258_SCALE_ROTATE_OUTPUT_REVERSE_HALFWORD;
  mock_sr_set_tickwait_hook(sr_fire_rott_complete_hook);
  assert_int_equal(bk7258_rotate(g_priv, &request), 0);
  assert_int_equal(mock_sr_reverse_input(),
                   ROTT_INPUT_REVESE_HALFWORD_BY_HALFWORD);
  assert_int_equal(mock_sr_reverse_output(),
                   ROTT_OUTPUT_REVESE_HALFWORD_BY_HALFWORD);
}

static void sr_rotate_error_isr(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  mock_sr_set_tickwait_hook(sr_fire_rott_error_hook);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EIO);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_SOFT_RESET), 0);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EIO);
}

static void sr_rotate_timeout(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  assert_int_equal(bk7258_rotate(g_priv, &request), -ETIMEDOUT);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_SOFT_RESET), 1);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_DRIVER_DEINIT), 0);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EIO);
}

static void sr_rotate_spurious_wake(void **state)
{
  (void)state;


  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  mock_sr_set_tickwait_hook(sr_post_spurious_hook);
  assert_int_equal(bk7258_rotate(g_priv, &request), -EIO);
  assert_int_equal(mock_sr_calls_of(MOCK_SR_FN_ROTT_SOFT_RESET), 1);
}

static void sr_fault_then_reinit(void **state)
{
  (void)state;
  sr_setup();

  struct bk7258_rotate_request_s request = sr_rotate_request(g_rsrc, g_rdst,
                                                              ROTATE_BYTES,
                                                              ROTATE_BYTES);

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   0);
  assert_int_equal(bk7258_rotate(g_priv, &request), -ETIMEDOUT);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_ROTATOR),
                   0);
  mock_sr_set_tickwait_hook(sr_fire_rott_complete_hook);
  assert_int_equal(bk7258_rotate(g_priv, &request), 0);
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
}

static void sr_scale_after_uninit_fails(void **state)
{
  (void)state;
  sr_setup();

  struct bk7258_scale_request_s request = sr_scale_request(g_src, g_dst,
                                                            FRAME_BYTES,
                                                            FRAME_BYTES);
  struct bk7258_scale_rotate_s *dead;

  assert_int_equal(bk7258_scale_rotate_initialize(
                     &g_priv, BK7258_SCALE_ROTATE_SCALE0),
                   0);
  dead = g_priv;
  assert_int_equal(bk7258_scale_rotate_uninitialize(g_priv), 0);
  assert_int_equal(bk7258_scale(dead, &request), -ENODEV);
  assert_int_equal(bk7258_scale_rotate_uninitialize(dead), -ENODEV);
}

int main(void)
{
  const struct CMUnitTest tests[] =
  {
    cmocka_unit_test_setup_teardown(sr_init_ok_scale0, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_ok_scale1, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_ok_rotator, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_null_out, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_invalid_engine, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_double, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_scale_driver_init_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_scale_isr_register_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_scale_int_enable_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_rott_driver_init_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_rott_complete_isr_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_rott_int_enable_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_init_rott_route_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_uninit_twice, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_uninit_bad_priv, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_uninit_scale0_ok, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_uninit_rotator_ok, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_uninit_scale_int_disable_fail, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_reinit_engine_switch, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_null_request, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_on_rotator, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_unsupported_format, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_dst_width_not_multiple_16, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_zero_dims, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_dim_too_large, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_src_size_too_small, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_dst_size_too_small, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_overlap, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_stack_buffers, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_hw_frame_fail, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_timeout, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_spurious_wake, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_scale0_happy, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_scale1_happy, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_scale1_threshold_variants, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_on_scale, sr_setup_ok,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_invalid_input_flow, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_invalid_output_flow, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_angle_180, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_block_count_mismatch, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_watermark_ge_count, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_block_pixels_exceed, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_src_size_too_small, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_overlap, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_config_fail, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_data_reverse_fail, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_happy_90, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_happy_none, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_happy_reversed_flows, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_error_isr, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_timeout, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_rotate_spurious_wake, sr_setup_rotator,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_fault_then_reinit, sr_setup_reset,
                                sr_teardown_ok),
    cmocka_unit_test_setup_teardown(sr_scale_after_uninit_fails, sr_setup_reset,
                                sr_teardown_ok),
  };

  return cmocka_run_group_tests_name("bk7258_scale_rotate", tests,
                             sr_group_setup, sr_group_teardown);
}
